PontusO/iLabs_nRF52_Arduino/boards.txt
# SoftDevice Menu
challenger_840_ble.menu.softdevice.s140v6=S140 6.1.1
challenger_840_ble.menu.softdevice.s140v6.build.sd_name=s140
challenger_840_ble.menu.softdevice.s140v6.build.sd_version=6.1.1
challenger_840_ble.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
challenger_840_ble.menu.debug.l0=Level 0 (Release)
challenger_840_ble.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
challenger_840_ble.menu.debug.l1=Level 1 (Error Message)
challenger_840_ble.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
challenger_840_ble.menu.debug.l2=Level 2 (Full Debug)
challenger_840_ble.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
challenger_840_ble.menu.debug.l3=Level 3 (Segger SystemView)
challenger_840_ble.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
challenger_840_ble.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
challenger_840_ble.menu.debug_output.serial=Serial
challenger_840_ble.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
challenger_840_ble.menu.debug_output.serial1=Serial1
challenger_840_ble.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
challenger_840_ble.menu.debug_output.rtt=Segger RTT
challenger_840_ble.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# External memory size
challenger_840_ble.menu.external_mem_size.0MB=0MB (None)
challenger_840_ble.menu.external_mem_size.0MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=None
challenger_840_ble.menu.external_mem_size.2MB=2MB (W25Q16FW)
challenger_840_ble.menu.external_mem_size.2MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q16FW
challenger_840_ble.menu.external_mem_size.4MB=4MB (W25Q32FV)
challenger_840_ble.menu.external_mem_size.4MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q32FV
challenger_840_ble.menu.external_mem_size.8MB=8MB (W25Q64JV_IM)
challenger_840_ble.menu.external_mem_size.8MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q64JV_IM
